<html>
<head>
<title>
Handbuch der Java-Programmierung, 7. Auflage
</title>
</head>
<body>
<a name="startofbody"></a>
<script language="JavaScript" src="hjp4lib.js">
</script>
<script language="JavaScript">
installKbdHandler("97,#startofbody;101,#endofbody;116,cover.html;122,k100003.html;115,search.html;105,index.html;100,JDKDOCS;112,APIDOCS;104,k100024.html;106,k100024.html;107,k100026.html;108,k100028.html");
</script>
<table border=0 cellpadding=0 cellspacing=1 width="100%">
<tr bgcolor="#EEFFCC">
<td width="7%" align=center bgcolor="#DDCC99"><a href="cover.html">&nbsp;Titel&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100003.html">&nbsp;Inhalt&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="search.html">&nbsp;Suchen&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="index.html">&nbsp;Index&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="../jdkdocs/index.html" onClick="this.href=getDocIndex()">&nbsp;DOC&nbsp;</a>
<td align="right">Handbuch der Java-Programmierung, 7. Auflage
<tr bgcolor="#EEFFCC">
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100024.html">&nbsp;&lt;&lt;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100024.html">&nbsp;&nbsp;&lt;&nbsp;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100026.html">&nbsp;&nbsp;&gt;&nbsp;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100028.html">&nbsp;&gt;&gt;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="../jdkdocs/api/index.html" onClick="this.href=getApiIndex()">&nbsp;API&nbsp;</a>
<td align="right">Kapitel 4 - Wie geht es weiter?
</table>
<hr>


<!-- Section -->
<a name="sectlevel2id004001"></a>
<h2>4.1 Wie sollte man dieses Buch lesen? </h2>
<hr>
<ul>
<li><a href="k100025.html#sectlevel2id004001">4.1 Wie sollte man dieses Buch lesen?</a>
<ul>
<li><a href="k100025.html#sectlevel3id004001001">4.1.1 Zu welchem Typ Leser geh&ouml;ren Sie?</a>
<li><a href="k100025.html#sectlevel3id004001002">4.1.2 Was ist der Inhalt der einzelnen Kapitel?</a>
<li><a href="k100025.html#sectlevel3id004001003">4.1.3 Wie geht es nun weiter?</a>
</ul>
</ul>
<hr>


<!-- Section -->
<a name="sectlevel3id004001001"></a>
<h3>4.1.1 Zu welchem Typ Leser geh&ouml;ren Sie? </h3>

<p>
Sie haben nun einen ersten Eindruck von Java gewonnen und wollen Ihr
Wissen vervollst&auml;ndigen. Nat&uuml;rlich k&ouml;nnen Sie das Buch
einfach Seite f&uuml;r Seite weiterlesen und dabei die Sprache Java
und den Umgang mit ihrer umfassenden Klassenbibliothek erlernen. Vielleicht
wollen Sie aber gar nicht bis <a href="k100257.html#kapitelapplets1">Kapitel 40</a>
warten, um zu erfahren, wie man ein Applet schreibt? Vermutlich wollen
Sie auch nicht bis <a href="k100332.html#kapitelwerkzeuge">Kapitel 53</a>
warten, um den Umgang mit dem Debugger kennenzulernen? Auch kann es
sein, dass Sie nicht an der Dateiein-/-ausgabe interessiert sind und
die <a href="k100127.html#kapitelcharacterstreams">Kapitel 19</a>,
<a href="k100132.html#kapitelbytestreams">20</a> und <a href="k100137.html#kapitelrandomaccessio">21</a>
daher zun&auml;chst &uuml;berspringen wollen. Je nach Ihren Vorkenntnissen
und Absichten wird eine ganz bestimmte Vorgehensweise sinnvoll sein.
Wir wollen in den n&auml;chsten Abschnitten ein paar Tipps zum Lesen
des Buchs und einige Hinweise zum Inhalt der einzelnen Kapitel geben.

<p>
Falls Sie zu dem Leserkreis geh&ouml;ren, der bereits einige Erfahrungen
mit der Entwicklung von Programmen in einer konventionellen Hochsprache
wie Pascal oder C hat, und Sie dieses Buch vor allem lesen, um auf
den Java-Zug aufzuspringen, sind Sie hier goldrichtig. Lesen Sie das
Buch einfach von vorne nach hinten und lernen Sie in jedem Kapitel
ein wenig dazu. Einige Dinge - insbesondere in den vorderen Kapiteln
- werden Ihnen vertraut vorkommen. Aber bereits ab <a href="k100052.html#kapiteloop1">Kapitel 8</a>
werden Sie mit vielen Neuigkeiten konfrontiert, die den Reiz der Sprache
ausmachen. Lesen Sie das Buch in aller Ruhe, nehmen Sie sich Zeit,
die Beispiele nachzuvollziehen, und machen Sie eigene Experimente.
Einige der Kapitel behandeln Spezialthemen, die nicht von jedem ben&ouml;tigt
werden, und k&ouml;nnen beim ersten Lesen &uuml;bersprungen werden.
Sie werden am Ende des Buchs ein sicheres Verst&auml;ndnis f&uuml;r
alle grundlegenden Belange der Java-Programmierung haben und k&ouml;nnen
sich leicht in komplexere Themengebiete einarbeiten. 

<p>
Falls Sie bereits weitreichende Programmiererfahrung in einer objektorientierten
Sprache wie C++ oder SmallTalk haben, werden Sie sich am Anfang unterfordert
f&uuml;hlen. Die in <a href="k100028.html#kapiteldatentypen">Kapitel 5</a>
bis <a href="k100046.html#kapitelanweisungen">Kapitel 7</a> eingef&uuml;hrten
Grundlagen kommen Ihnen bekannt vor, die ab <a href="k100052.html#kapiteloop1">Kapitel 8</a>
behandelte objektorientierte Programmierung kennen Sie im Schlaf und
die in <a href="k100090.html#progstrukturierung">Kapitel 14</a> vorgestellten
Techniken zur Entwicklung gr&ouml;&szlig;erer Programme sind ebenfalls
nichts Neues f&uuml;r Sie. Aber kennen Sie sich auch mit Multithreading,
Kryptografie, dem Abstract Windowing Toolkit und den Java Foundation
Classes aus? Wissen Sie, wie grafische Animationen entwickelt werden,
wie man Objekte im Netz verteilt oder auf SQL-Datenbanken zugreift?
Kennen Sie Java-Konzepte wie Serialisierung, Reflection oder Beans?
Wenn nicht, dann werden auch Sie in diesem Buch interessante und wissenswerte
Neuigkeiten finden. 

<p>
Falls Sie zu dem Leserkreis geh&ouml;ren, der haupts&auml;chlich Applets
entwickeln will, versp&uuml;ren Sie wahrscheinlich keine Lust, viele
Kapitel darauf zu warten, das erste Applet vorgesetzt zu bekommen.
Nat&uuml;rlich m&uuml;ssen Sie die Grundlagen der Sprache kennen,
um Applets entwickeln zu k&ouml;nnen. Es spricht aber nichts dagegen,
dass Sie sich bereits w&auml;hrend der Lekt&uuml;re der Grafikgrundlagen
in den Kapiteln <a href="k100157.html#kapitelgrafikausgabe">24</a>
bis <a href="k100185.html#kapitellowlevelevents">29</a> mit der Applet-Programmierung,
die in <a href="k100257.html#kapitelapplets1">Kapitel 40</a> und <a href="k100263.html#kapitelapplets2">41</a>
beschrieben wird, vertraut machen. Die Unterschiede zwischen Applikationen
und Applets halten sich in Grenzen und sie werden genau erkl&auml;rt.

<p>
Auch wenn Sie zu dem Typ Leser geh&ouml;ren, der B&uuml;cher nie am
St&uuml;ck liest, sondern nur dann zur Hand nimmt, wenn er nach einer
L&ouml;sung f&uuml;r ein spezielles Problem sucht, kann dieses Buch
f&uuml;r Sie n&uuml;tzlich sein. Die Gliederung erleichtert auch das
Wiederfinden spezieller Themen. Verwenden Sie einfach das Inhaltsverzeichnis
oder den umfassenden Index, um das Thema zu finden, an dem Sie gerade
besonders interessiert sind. Z&ouml;gern Sie nicht, die Beispielprogramme
in die Tat umzusetzen und eigene Experimente durchzuf&uuml;hren. Es
gibt viele Leser, die auf diese Weise am besten lernen. 

<p>
Wenn Sie dagegen &uuml;berhaupt keine Programmiererfahrung haben,
wird die Lekt&uuml;re des Buchs nicht einfach werden. An vielen Stellen
werden Grundkenntnisse in Datenstrukturen, Algorithmen und der Entwicklung
von Computerprogrammen vorausgesetzt. Die Kapitel mit den fortgeschrittenen
Themen setzen dar&uuml;ber hinaus ein gutes Verst&auml;ndnis der einf&uuml;hrenden
Kapitel voraus. Sollten Ihnen diese Kenntnisse fehlen, versuchen Sie
unbedingt, sie sich anzueignen. In <a href="k100026.html#wiehilfeerhalten">Abschnitt 4.2</a>
finden Sie Hinweise auf weiterf&uuml;hrende Dokumentationen und Online-Ressourcen,
die Ihnen dabei helfen k&ouml;nnen. 
<p>
<table border=0 cellspacing=0 cellpadding=0 width=100%>
<tr>
<td width=1 align=left valign=top bgcolor="#CC0000"><img src="trp1_1.gif"></td>
<td><img src="trp1_1.gif" width=1></td>
<td width=1 align=left valign=top bgcolor="#CC0000"><img src="trp1_1.gif"></td>
<td><img src="trp1_1.gif" width=2></td>
<td valign=top width=1000>

<p>
Einigen Zuschriften entnahm ich, dass es den Lesern mitunter an elementaren
Grundkenntnissen im Umgang mit dem Computer und seinem Betriebssystem
mangelt. Die Leser dieser Gruppe sind dann gleich zu Beginn frustriert,
weil etwa die Installation des JDK nicht klappt, der PATH nicht gesetzt
wurde oder sie noch nie einen Editor gesehen haben. Falls Sie zu dieser
Gruppe geh&ouml;ren, sollten Sie sich das fehlende Wissen unbedingt
aneignen, sonst sind Misserfolgserlebnisse vorprogrammiert. In <a href="k100015.html#troubleshooting">Abschnitt 2.3.7</a>
werden einige Hinweise zu diesen elementaren Themen gegeben, aber
ausreichend ist das nur, wenn schon gewisse Grundkenntnisse vorhanden
sind.</td>
<td><img src="trp1_1.gif" width=2></td>
<td valign=top>
<table border=0 cellspacing=0 cellpadding=1 width=100% bgcolor="#CC0000">
<tr>
<td><font color="#FFFFFF">&nbsp;Warnung&nbsp;</font></td>
</tr>
</table>
</td>
<td width=1 align=left valign=top bgcolor="#CC0000"><img src="trp1_1.gif"></td>
</tr>
</table>
<p>
<table border=0 cellspacing=0 cellpadding=0 width=100%>
<tr>
<td width=1 align=left valign=top bgcolor="#000077"><img src="trp1_1.gif"></td>
<td><img src="trp1_1.gif" width=2></td>
<td valign=top width=1000>

<p>
Dieses Buch enth&auml;lt an vielen Stellen Vorw&auml;rtsverweise auf
Themen, die noch nicht behandelt wurden. Dadurch wird den Verflechtungen
innerhalb der Themenbereiche Rechnung getragen und man findet beim
Nachschlagen schnell alle relevanten Textstellen. Wenn Sie beim Lesen
auf einen Vorw&auml;rtsverweis sto&szlig;en, k&ouml;nnen Sie normalerweise
zun&auml;chst warten, bis die Erkl&auml;rung nachgereicht wird (oftmals
schon kurze Zeit sp&auml;ter). Sie k&ouml;nnen den Begriff nat&uuml;rlich
auch sofort nachschlagen, aber aus didaktischen Gr&uuml;nden ist das
meist nicht unbedingt notwendig.</td>
<td><img src="trp1_1.gif" width=2></td>
<td valign=top>
<table border=0 cellspacing=0 cellpadding=1 width=100% bgcolor="#000077">
<tr>
<td><font color="#FFFFFF">&nbsp;Hinweis&nbsp;</font></td>
</tr>
</table>
</td>
<td width=1 align=left valign=top bgcolor="#000077"><img src="trp1_1.gif"></td>
</tr>
</table>


<!-- Section -->
<a name="sectlevel3id004001002"></a>
<h3>4.1.2 Was ist der Inhalt der einzelnen Kapitel? </h3>

<p>
Die Kapitel <a href="k100008.html#kapitelintro">1</a>, <a href="k100012.html#kapitelschnelleinstieg">2</a>
und <a href="k100017.html#kapitelides">3</a> haben Sie vermutlich
bereits gelesen. Sie kennen also die wichtigsten Schlagworte zu Java
und haben ein lauff&auml;higes Entwicklungssystem. In diesem Kapitel
erhalten Sie Informationen zum Inhalt des Buchs und bekommen Tipps,
wie Sie es am besten verwenden k&ouml;nnen. Auch Hinweise auf weiterf&uuml;hrende
Informationen finden Sie hier. 

<p>
Die Kapitel <a href="k100028.html#kapiteldatentypen">5</a>, <a href="k100036.html#kapitelausdruecke">6</a>
und <a href="k100046.html#kapitelanweisungen">7</a> besch&auml;ftigen
sich mit den elementaren Eigenschaften der Sprache. Sie erkl&auml;ren
die lexikalische Struktur von Java-Programmen und stellen Datentypen,
Ausdr&uuml;cke und Anweisungen vor. Wenn Sie bereits mit C oder C++
vertraut sind, werden Ihnen viele Dinge bekannt vorkommen. Dennoch
gibt es einige elementare, wichtige Unterschiede und auch als erfahrener
C/C++-Programmierer sollten Sie nicht vollst&auml;ndig auf die Lekt&uuml;re
dieser Kapitel verzichten. 

<p>
<a href="k100052.html#kapiteloop1">Kapitel 8</a> erkl&auml;rt wichtige
Grundlagen der objektorientierten Programmierung und erl&auml;utert
Klassen und Objekte in Java. Auch die Definition und Verwendung von
Methoden werden in diesem Kapitel behandelt. <a href="k100057.html#kapiteloop2">Kapitel 9</a>
ist ebenfalls essenziell. Es beschreibt die Prinzipien der Vererbung,
erl&auml;utert Attribute von Klassen und erkl&auml;rt statische Membervariablen
und Methoden. Schlie&szlig;lich werden abstrakte Klassen und Polymorphismus
behandelt. Zu den wichtigsten Techniken der objektorientierten Programmierung
in Java geh&ouml;ren Interfaces, die in <a href="k100063.html#kapiteloop3">Kapitel 10</a>
beschrieben werden. Mit der Vorstellung einiger weiterf&uuml;hrender
Themen bildet <a href="k100070.html#kapiteloop4">Kapitel 11</a> den
Abschluss der objektorientierten Programmierung. W&auml;hrend lokale
und anonyme Klassen ebenso wie Wrapper-Klassen zum Handwerkszeug jedes
Java-Programmierers geh&ouml;ren sollten, ist der ausf&uuml;hrliche
Teil &uuml;ber Design-Patterns optional und kann beim ersten Lesen
ausgelassen werden. 

<p>
Im n&auml;chsten Teil des Buchs werden weiterf&uuml;hrende Spracheigenschaften
und Grundlagen der Klassenbibliothek behandelt. Die Kapitel <a href="k100076.html#kapitelstrings">12</a>
bis <a href="k100121.html#kapitelutilities2">18</a> sind ebenso wichtig
wie die Grundlagen der Sprache. Sie behandeln Strings, Exceptions
und Packages, erkl&auml;ren die Collections und stellen die wichtigsten
Utility-Klassen vor. Einzig <a href="k100104.html#kapitelcollections2">Kapitel 16</a>
k&ouml;nnte beim ersten Lesen &uuml;bersprungen werden, denn dort
wird das mit dem JDK 1.2 eingef&uuml;hrte Collection-API vorgestellt.
Die seit der Version 1.0 vorhandenen Collections sind dagegen Pflicht
und werden in <a href="k100097.html#kapitelcollections1">Kapitel 15</a>
behandelt. Die n&auml;chsten vier Kapitel <a href="k100127.html#kapitelcharacterstreams">19</a>
bis <a href="k100143.html#verzeichnisse">22</a> besch&auml;ftigen
sich mit Dateizugriffen. Sie erl&auml;utern zeichen- und byteorientierte
Streams, Random-Access-Dateien und den Zugriff auf Verzeichnisse.
Den Abschluss des vierten Teils bildet <a href="k100150.html#kapitelmultithreading">Kapitel 23</a>
mit der Behandlung des Multithreadings. 

<p>
Die darauffolgenden Kapitel besch&auml;ftigen sich mit dem Abstract
Windowing Toolkit und zeigen, wie man Java-Programme mit grafischer
Oberfl&auml;che schreibt. W&auml;hrend die <a href="k100157.html#kapitelgrafikausgabe">Kapitel 24</a>
bis <a href="k100185.html#kapitellowlevelevents">29</a> Grundlagen
behandeln, die auch dann wichtig sind, wenn nur Swing-Programme geschrieben
werden sollen, werden in den Kapiteln <a href="k100193.html#kapitelmenues">30</a>
und <a href="k100207.html#kapitelawtdialogelemente">32</a> ausschlie&szlig;lich
AWT-Men&uuml;s und -Dialogelemente vorgestellt. <a href="k100202.html#kapitelguidialoge">Kapitel 31</a>
erkl&auml;rt den Umgang mit Layoutmanagern und ist sowohl f&uuml;r
AWT- als auch f&uuml;r Swing-Programme wichtig. Den Abschluss dieses
Teils bilden zwei Kapitel, in denen gezeigt wird, wie eigene Dialogelemente
entwickelt werden k&ouml;nnen und wie man Bitmaps und Animationen
einsetzt. Zwar sind sie weitgehend AWT-spezifisch, doch ist ihr Inhalt
auch f&uuml;r entsprechende Swing-Programme und zum Verst&auml;ndnis
der Java-Beans-Architektur vonn&ouml;ten. 

<p>
Teil 6 des Buchs befasst sich mit der Programmierung von grafischen
Oberfl&auml;chen mit Swing. W&auml;hrend in <a href="k100236.html#kapitelswinggrundlagen">Kapitel 36</a>
Grundlagen erkl&auml;rt und Unterschiede bzw. Parallelen zum AWT aufgezeigt
werden, behandeln die n&auml;chsten drei Kapitel alle wichtigen Dialogelemente
des Swing-Toolkits. Zusammen mit den im vorigen Teil vermittelten
Grundlagen stehen nach Ende dieses Teils ausreichend Kenntnisse zur
Entwicklung eigener Swing-Applikationen zur Verf&uuml;gung. 

<p>
In den nachfolgenden Kapiteln <a href="k100257.html#kapitelapplets1">40</a>
und <a href="k100263.html#kapitelapplets2">41</a> wird die Applet-Programmierung
erl&auml;utert. Diese Kapitel k&ouml;nnen bei Bedarf auch vorgezogen
werden, insbesondere Swing-Kenntnisse sind zu ihrem Verst&auml;ndnis
nicht n&ouml;tig. Die Grundlagen der Grafikprogrammierung aus Kapitel
5 sollten Sie allerdings gelesen haben. 

<p>
Die beiden letzten Teile des Buchs behandeln eine Reihe weiterf&uuml;hrender
Themen. Die Kapitel <a href="k100269.html#kapitelserialisierung">42</a>,
<a href="k100278.html#kapiteljdbc">44</a> und <a href="k100300.html#kapitelpersistence">47</a>
erweitern die M&ouml;glichkeiten, Daten persistent zu speichern. Sie
erl&auml;utern das Serialisieren von Objekten und beschreiben den
Zugriff auf relationale Datenbanken. In <a href="k100284.html#kapitelreflection">Kapitel 45</a>
wird gezeigt, wie mit Hilfe des Reflection-API zur Laufzeit auf die
Interna von Klassen und Objekten zugegriffen werden kann und wie man
mit Hilfe von Annotationen Zusatzinformationen in bestehende Klassen
integrieren kann. In <a href="k100292.html#kapitelbeans">Kapitel 46</a>
wird die zum Erstellen eigenst&auml;ndiger Komponenten wichtige Java-Beans-Architektur
vorgestellt. 

<p>
Die n&auml;chsten beiden Kapitel <a href="k100307.html#kapitelnetzwerkprogrammierung">48</a>
und <a href="k100313.html#kapitelrmi">49</a> besch&auml;ftigen sich
mit der Netzwerkprogrammierung. W&auml;hrend das erste die Grundlagen
vorstellt und zeigt, wie TCP/IP-Clients und -Server geschrieben werden,
stellt das zweite verteilte Objektarchitekturen mit RMI vor. Den Abschluss
dieses Teils bildet <a href="k100317.html#kapitelsicherheit">Kapitel 50</a>
mit der Vorstellung des Sicherheitskonzepts von Java und der Beschreibung
signierter Applets. Hier werden auch wichtige kryptografische Grundlagen
erl&auml;utert. In <a href="k100322.html#kapitelsound">Kapitel 51</a>
wird das Sound-API vorgestellt und in den letzten beiden Kapiteln
des Buchs werden Hinweise zur Steigerung der Performance von Java-Programmen
und zum Umgang mit den Hilfsprogrammen des JDK gegeben. 

<!-- Section -->

<a name="sectlevel3id004001003"></a>
<h3>4.1.3 Wie geht es nun weiter? </h3>

<p>
Dass man B&uuml;cher unterschiedlich gliedern kann, ist kein Geheimnis.
Dass die Beschreibung einer Programmiersprache mehr Aufwand erfordert
als die eines Mobiltelefons oder Videorecorders, ist ebenfalls bekannt.
Ist es nun besser, eine umfangreiche Programmiersprache zun&auml;chst
aus der Vogelperspektive zu betrachten und nur die jeweils ben&ouml;tigten
Themen rezeptartig nachzuschlagen? Um so mit geringstem Mitteleinsatz
fr&uuml;hzeitig lauff&auml;hige (aber nicht notwendigerweise verstandene)
Ergebnisse zu produzieren? Oder sollte man zun&auml;chst die Grundlagen
der Sprache studieren und erst sp&auml;ter die komplexeren Hilfsmittel
auf der Basis eines soliden Grundlagenwissens einsetzen? 

<p>
Wie die Kapitelaufteilung zeigt, wurde dieses Buch unter der Annahme
geschrieben, dass der zweite Ansatz der sinnvollere ist. Platt ausgedr&uuml;ckt,
stehen die einfachen Dinge weiter vorne und die schwierigen weiter
hinten und im Zweifelsfall ist diese Leserichtung durchaus sinnvoll.
Das soll allerdings keinesfalls hei&szlig;en, dass unter allen Umst&auml;nden
und f&uuml;r alle Leser das sequenzielle Durchlesen die richtige Vorgehensweise
ist. Wie erw&auml;hnt, mag es durchaus sinnvoll sein, zu einem anderen
Ablauf zu kommen. Gerade beim Einsatz im gesch&auml;ftlichen Umfeld
hat man durch Termin- und Projektdruck nicht immer die Zeit, die Anwendung
neuer Werkzeuge mit der n&ouml;tigen Ruhe zu erlernen. 

<p>
Letztendlich m&uuml;ssen Sie selbst entscheiden, welche der Kapitel
Sie durchlesen wollen und in welcher Reihenfolge Sie das tun. Die
vorgegebene Kapitelaufteilung und -reihenfolge mag Ihnen dabei ein
Leitfaden sein. W&auml;hlen Sie die Technik, die Ihren Neigungen und
Erwartungen am meisten entgegenkommt und am besten mit Ihren Beweggr&uuml;nden
in Einklang zu bringen ist. Dann werden Sie den gr&ouml;&szlig;tm&ouml;glichen
Nutzen aus dem Buch ziehen. 
<hr>
<table border=0 cellpadding=0 cellspacing=1 width="100%">
<tr bgcolor="#EEFFCC">
<td width="7%" align=center bgcolor="#DDCC99"><a href="cover.html">&nbsp;Titel&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100003.html">&nbsp;Inhalt&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="search.html">&nbsp;Suchen&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="index.html">&nbsp;Index&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="../jdkdocs/index.html" onClick="this.href=getDocIndex()">&nbsp;DOC&nbsp;</a>
<td align="right">Handbuch der Java-Programmierung, 7. Auflage, Addison
Wesley, Version 7.0
<tr bgcolor="#EEFFCC">
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100024.html">&nbsp;&lt;&lt;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100024.html">&nbsp;&nbsp;&lt;&nbsp;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100026.html">&nbsp;&nbsp;&gt;&nbsp;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="k100028.html">&nbsp;&gt;&gt;&nbsp;</a>
<td width="7%" align=center bgcolor="#DDCC99"><a href="../jdkdocs/api/index.html" onClick="this.href=getApiIndex()">&nbsp;API&nbsp;</a>
<td align="right">&copy; 1998, 2011 Guido Kr&uuml;ger &amp; Heiko
Hansen, <a href="http://www.javabuch.de">http://www.javabuch.de</a>
</table>
<a name="endofbody"></a>
</body>
</html>
